{"modelTopology": {"training_config": {"metrics": [], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "RMSprop", "config": {"clipnorm": 5.0, "epsilon": 1e-07, "lr": 9.999999747378752e-06, "rho": 0.8999999761581421, "decay": 0.0}}, "loss_weights": null, "sample_weight_mode": null}, "keras_version": "2.2.2", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "dtype": "float32", "output_dim": 64, "trainable": true, "embeddings_regularizer": null, "input_dim": 98, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [128, 32], "activity_regularizer": null, "input_length": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.05, "seed": null, "trainable": true, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "unit_forget_bias": true, "activation": "tanh", "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "activity_regularizer": null, "stateful": true, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.05, "seed": null, "trainable": true, "name": "dropout_2"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 98, "use_bias": true, "activation": "softmax", "name": "dense_1"}}, "trainable": true, "name": "time_distributed_1"}}]}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"dtype": "float32", "shape": [98, 64], "name": "embedding_1/embeddings"}, {"dtype": "float32", "shape": [64, 2048], "name": "lstm_1/kernel"}, {"dtype": "float32", "shape": [512, 2048], "name": "lstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [2048], "name": "lstm_1/bias"}, {"dtype": "float32", "shape": [512, 98], "name": "time_distributed_1/kernel"}, {"dtype": "float32", "shape": [98], "name": "time_distributed_1/bias"}]}]}