{"modelTopology": {"training_config": {"metrics": [], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "clipnorm": 5.0, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 0.009999999776482582}}, "loss_weights": null, "sample_weight_mode": null}, "keras_version": "2.2.0", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "dtype": "float32", "output_dim": 32, "trainable": true, "embeddings_regularizer": null, "input_dim": 98, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [128, 64], "activity_regularizer": null, "input_length": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "implementation": 1, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "stateful": true, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "return_state": false, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_2"}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "implementation": 1, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "stateful": true, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "go_backwards": false, "return_state": false, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_3"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 98, "use_bias": true, "activation": "softmax"}}, "trainable": true, "name": "time_distributed_1"}}]}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [98, 32], "name": "embedding_1/embeddings"}, {"dtype": "float32", "shape": [32, 1024], "name": "lstm_1/kernel"}, {"dtype": "float32", "shape": [256, 1024], "name": "lstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [1024], "name": "lstm_1/bias"}, {"dtype": "float32", "shape": [256, 1024], "name": "lstm_2/kernel"}, {"dtype": "float32", "shape": [256, 1024], "name": "lstm_2/recurrent_kernel"}, {"dtype": "float32", "shape": [1024], "name": "lstm_2/bias"}, {"dtype": "float32", "shape": [256, 98], "name": "time_distributed_1/kernel"}, {"dtype": "float32", "shape": [98], "name": "time_distributed_1/bias"}]}]}